option = {
    title: {
        text: '企业-特征：相关系数',
        // subtext: 'dataZoom支持'
    },
    tooltip: {
        trigger: 'axis',
        axisPointer: {
            show: true,
            type: 'cross',
            lineStyle: {
                type: 'dashed',
                width: 1
            }
        }
    },
    toolbox: {
        show: true,
        feature: {
            mark: { show: true },
            dataView: { show: true, readOnly: false },
            restore: { show: true },
            saveAsImage: { show: true }
        }
    },
    // dataZoom: {
    //     show: true,
    //     start: 30,
    //     end: 70
    // },
    legend: {
        data: ['相关系数']
    },
    dataRange: {
        min: 0,
        max: 0.12,
        orient: 'horizontal',
        y: 30,
        x: 'center',
        //text:['高','低'],           // 文本，默认为数值文本
        color: ['lightgreen', 'orange'],
        splitNumber: 5
    },
    xAxis: [{
        type: 'category',
        data: ['云南铝业', '贵州铝厂', '日丰企业', '广州香雪制药', '珠海制药', '荣宏塑料', '华星光电']
    }],
    yAxis: [{
        type: 'category',
        data: ['节假日', '温度', '湿度', '期货', '阿里指数', '季节性', '大事件']
    }],
    animation: false,
    series: [{
        name: '相关系数',
        type: 'scatter',
        tooltip: {
            trigger: 'item',
            // formatter: function(params) {
            //     return params.seriesName + ' （' + '类目' + params.value[0] + '）<br/>' +
            //         params.value[1] + ', ' +
            //         params.value[2];
            // },
            axisPointer: {
                show: true
            }
        },
        symbolSize: function(value, params) {
            // console.info(value)
            // console.info(params)
            return value[2] * 800
        },
        data: [
            [0, 0, 0.01],
            [0, 1, 0.01],
            [0, 2, 0.01],
            [0, 3, 0.1],
            [0, 4, 0.01],
            [0, 5, 0.01],
            [0, 6, 0.1],
            [1, 0, 0.02],
            [1, 1, 0.01],
            [1, 2, 0.01],
            [1, 3, 0.02],
            [1, 4, 0.01],
            [1, 5, 0.01],
            [1, 6, 0.01],
            [2, 0, 0.11],
            [2, 1, 0.04],
            [2, 2, 0.04],
            [2, 3, 0.01],
            [2, 4, 0.01],
            [2, 5, 0.12],
            [2, 6, 0.01],
            [3, 0, 0.05],
            [3, 1, 0.08],
            [3, 2, 0.08],
            [3, 3, 0.01],
            [3, 4, 0.01],
            [3, 5, 0.12],
            [3, 6, 0.01],
            [4, 0, 0.05],
            [4, 1, 0.01],
            [4, 2, 0.01],
            [4, 3, 0.01],
            [4, 4, 0.01],
            [4, 5, 0.01],
            [4, 6, 0.1],
            [5, 0, 0.12],
            [5, 1, 0.01],
            [5, 2, 0.01],
            [5, 3, 0.01],
            [5, 4, 0.01],
            [5, 5, 0.05],
            [5, 6, 0.01],
            [6, 0, 0.08],
            [6, 1, 0.01],
            [6, 2, 0.01],
            [6, 3, 0.01],
            [6, 4, 0.01],
            [6, 5, 0.03],
            [6, 6, 0.1],
        ]
    }]
};
// data: [
//     [0, 0, 0.01],
//     [0, 1, 0.01],
//     [0, 2, 0.01],
//     [0, 3, 0.1],
//     [0, 4, 0.01],
//     [0, 5, 0.01],
//     [0, 6, 0.1],
//     [1, 0, 0.02],
//     [1, 1, 0.01],
//     [1, 2, 0.01],
//     [1, 3, 0.02],
//     [1, 4, 0.01],
//     [1, 5, 0.01],
//     [1, 6, 0.01],
//     [2, 0, 0.11],
//     [2, 1, 0.04],
//     [2, 2, 0.04],
//     [2, 3, 0.01],
//     [2, 4, 0.01],
//     [2, 5, 0.12],
//     [2, 6, 0.01],
//     [3, 0, 0.05],
//     [3, 1, 0.08],
//     [3, 2, 0.08],
//     [3, 3, 0.01],
//     [3, 4, 0.01],
//     [3, 5, 0.12],
//     [3, 6, 0.01],
//     [4, 0, 0.05],
//     [4, 1, 0.01],
//     [4, 2, 0.01],
//     [4, 3, 0.01],
//     [4, 4, 0.01],
//     [4, 5, 0.01],
//     [4, 6, 0.1],
//     [5, 0, 0.12],
//     [5, 1, 0.01],
//     [5, 2, 0.01],
//     [5, 3, 0.01],
//     [5, 4, 0.01],
//     [5, 5, 0.05],
//     [5, 6, 0.01],
//     [6, 0, 0.08],
//     [6, 1, 0.01],
//     [6, 2, 0.01],
//     [6, 3, 0.01],
//     [6, 4, 0.01],
//     [6, 5, 0.03],
//     [6, 6, 0.1],
// ]